In [35]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
file = "C:/student_health_2.csv"
df = pd.read_csv(file, encoding='cp949')

In [49]:
df1 = df['학년'].value_counts(sort=False)
df1 = pd.DataFrame(df1)
df1

    학년
1  591
2  599
3  601
4  591
5  595
6  592

In [37]:
group_height = df.groupby("학년")['키'].value_counts(sort = False)
group_weight = df.groupby("학년")['몸무게'].value_counts(sort = False)
group_sys = df.groupby("학년")['수축기'].value_counts(sort = False)
group_dia = df.groupby("학년")['이완기'].value_counts(sort = False)

group_weight

학년  몸무게
1   15.9    1
    16.4    1
    16.8    1
    17.0    1
    17.3    2
           ..
6   79.4    1
    84.4    1
    84.5    1
    88.8    1
    90.2    1
Name: 몸무게, Length: 1398, dtype: int64

In [38]:
group_height

학년  키
1   107.7    1
    108.0    1
    108.9    1
    109.3    1
    109.6    1
            ..
6   168.6    1
    168.8    1
    168.9    2
    169.1    1
    171.9    1
Name: 키, Length: 1303, dtype: int64

In [39]:
group_sys

학년  수축기
1   65.0     1
    70.0     8
    71.0     1
    72.0     1
    73.0     1
            ..
4   125.0    1
    126.0    1
    127.0    1
    128.0    1
    134.0    1
Name: 수축기, Length: 104, dtype: int64

In [40]:
group_dia

학년  이완기
1   37.0     1
    40.0    16
    41.0     1
    43.0     1
    45.0     4
            ..
4   80.0     3
    84.0     1
    86.0     1
    87.0     1
    94.0     1
Name: 이완기, Length: 78, dtype: int64

In [43]:
grouped = df.groupby('학년')['키','몸무게','수축기','이완기'].agg(['mean'])
grouped

C:\Users\USER\AppData\Local\Temp\ipykernel_11120\2698009750.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped = df.groupby('학년')['키','몸무게','수축기','이완기'].agg(['mean'])

             키        몸무게         수축기        이완기
          mean       mean        mean       mean
학년
1   121.106430  24.390186   94.505396  58.789568
2   127.584474  27.719866         NaN        NaN
3   133.401830  31.299667         NaN        NaN
4   139.384602  36.419628  100.110721  61.314587
5   144.822017  40.563193         NaN        NaN
6   151.969932  45.954899         NaN        NaN

In [44]:
group1 = df.groupby('학년')['이완기'].agg(['mean'])
group1

         mean
학년
1   58.789568
2         NaN
3         NaN
4   61.314587
5         NaN
6         NaN

In [62]:
dfdf = pd.concat([df1,grouped], axis = 1)
dfdf

    학년   (키, mean)  (몸무게, mean)  (수축기, mean)  (이완기, mean)
1  591  121.106430    24.390186    94.505396    58.789568
2  599  127.584474    27.719866          NaN          NaN
3  601  133.401830    31.299667          NaN          NaN
4  591  139.384602    36.419628   100.110721    61.314587
5  595  144.822017    40.563193          NaN          NaN
6  592  151.969932    45.954899          NaN          NaN

In [64]:
dfdf.columns = ['학년 인원수','키 평균', '몸무게 평균', '수축기 평균', '이완기 평균']
dfdf

   학년 인원수        키 평균     몸무게 평균      수축기 평균     이완기 평균
1     591  121.106430  24.390186   94.505396  58.789568
2     599  127.584474  27.719866         NaN        NaN
3     601  133.401830  31.299667         NaN        NaN
4     591  139.384602  36.419628  100.110721  61.314587
5     595  144.822017  40.563193         NaN        NaN
6     592  151.969932  45.954899         NaN        NaN

In [63]:
dfdf.columns

Index(['학년', ('키', 'mean'), ('몸무게', 'mean'), ('수축기', 'mean'), ('이완기', 'mean')], dtype='object')